import math

import math
import random

# # Задача № 1. Получить реверсную запись трехзначного числа
# # Пример:
# # вход: 346, выход: 643
# # вход: 100, выход: 001
#
#
# def revers():
#     print('Введите последовательность: ')
#     a = input()
#     a = list(reversed(a))
#     print(a)
#
#
# if __name__ == '__main__':
#     revers()

# Задача №2. Посчитать размер вклада на счете за несколько лет.
#
# Вход:
# размер начального вклада (от 100 до 1000000 рублей),
# годовой процент начисления(от 1 до 20) с капитализацией
#                 (используем формулу сложных процентов),
# количество лет по вкладу(от 1 до 100).
#
# Выход: итоговая сумма на счету.

a = random.randint(100, 10000)
print(a)